console.log('Задание 1.1');
var с = + prompt ( 'Введите температуру в градусах Цельсия: ' ),

f = 1.8*с + 32;

console.log( 'Температура по Фаренгейту: ' + f  );


console.log('Задание 1.2');

let name = 'Василий';
let admin = name;
console.log(admin);

console.log('Задание 1.3');

console.log(10	+	10	+	"10")	// к интовому результату прибавляем строку
console.log(10	+	"10"	+	10)	// к инту добавляем строку а потом полученное значение прибавляем к инту
console.log(10	+	10	+	+"10")	// сложение двух чисел, после добавляется строка
console.log(10	/	-"")	// из числа вычитается пустая строка
console.log(10	/	+"2,5") // число делим на строку

